//! JavaScript Condition

/* 

TODO--> JavaScript Condition Practice:

*1. তোর আম্মু বলছে, 6টার আগে বাসায় ফিরলে তোকে নাস্তা খাওয়াবে। আর দেরি করলে ঝাড়ুর বাড়ি দিবে। এই শর্তের জন্য কোড কর।

*2. একটা মোবাইল অ্যাপে যদি লগইন সফল হয়, তাহলে "Welcome!" দেখাবে। যদি ব্যর্থ হয়, "Get Lost!" দেখাবে। এই শর্তের জন্য প্রোগ্রাম লিখ।

*3. তুই যদি 5 কি. মি. দৌড়াস, তাহলে তোকে চকলেট খেতে দিবে। যদি না দৌড়াস, তাহলে তোর মোটা ভুঁড়ি হবে। এই শর্তের জন্য প্রোগ্রাম লিখ।

*4. ধর, তোর বাবা বলেছে, যদি তুই পরীক্ষায় ৪০-এর বেশি পেয়ে পাস করিস, তাহলে তোকে বাইক কিনে দিবে। কিন্তু যদি কম হয়, তাহলে বাইক দিবে না। একটা প্রোগ্রাম লিখে দেখ, তুই বাইক পাবি কি না, যদি তোর নম্বর 85 হয়।

*5. যদি মুভির শো রাত ৭টার আগে হয়, তাহলে তুই মুভি দেখবি। যদি পরে হয়, তাহলে বাসায় গিয়ে নাকে তেল দিয়ে ঘুমাবি। এর জন্য প্রোগ্রাম লিখ।

*6. তাপমাত্রা 30 ডিগ্রি বা তার বেশি হয়, তাহলে এয়ার কন্ডিশনার চালাবি। আর কম হলে কম্বল মুড়ি দিয়েই ঘুমাবি। এর জন্য কোড লিখ।

*/

let arrivalTime = 5; // ঘন্টায়
if (arrivalTime < 6) {
    console.log("নাস্তা খাওয়াবে");
} else {
    console.log("ঝাড়ুর বাড়ি দিবে");
}
//
let loginSuccess = false;
if (loginSuccess) {
    console.log("Welcome!");
} else {
    console.log("Get Lost!");
}
//
let runDistance = 4; // কি. মি.
if (runDistance >= 5) {
    console.log("চকলেট খেতে দিবে");
} else {
    console.log("মোটা ভুঁড়ি হবে");
}
//
let examScore = 85;
if (examScore > 80) {
    console.log("বাইক কিনে দিবে");
} else {
    console.log("বাইক দিবে না");
}
//
let showTime = 9; // ঘন্টায়
if (showTime > 10) {
    console.log("মুভি দেখবি");
} else {
    console.log("নাকে তেল দিয়ে ঘুমাবি");
}
//
let temperature = 32; // ডিগ্রি সেলসিয়াস
if (temperature <= 36) {
    console.log("এয়ার কন্ডিশনার চালাবি");
} else {
    console.log("কম্বল মুড়ি দিয়েই ঘুমাবি");
}

//! How && and || Operators Really Work in JavaScript
/*
a && b
a || b
? দুইটি শর্তই পূরণ করতে হবে (AND কেস)।
? দুটি শর্তের যেকোনো একটি পূরণ হলেই হবে (OR কেস)।
*/


/*

TODO-->JavaScript multiple condition Practice:

*1. একটি প্রোগ্রাম লিখ। যেটা চেক করবে, বয়স 18-এর বেশি কি না এবং উচ্চতা 60 ইঞ্চির বেশি কি না। তাহলে সে গাড়ি ঠেলবে, না হয় সে গাড়িতে বসে থাকবে।
*2. একটি প্রোগ্রাম লিখ। যা চেক করবে, একজন শিক্ষার্থী ভর্তি হওয়ার যোগ্য কি না। গণিত স্কোর ৪০-এর বেশি অথবা ইংরেজি স্কোর 85-এর বেশি হতে হবে। আর এইগুলার কোনোটাই সত্যি না হলে বলবি— তোকে বিয়ে দিয়ে দিব।
*3. একজন স্টুডেন্টের GPA যদি 5 হয় এবং পরিবারের মাসিক আয় 10000-এর কম হয়, তাহলে সে স্কলারশিপ পাবে। না হয় তাকে বেতন দিয়ে পড়তে হবে।
*4. একজন চাকরিপ্রার্থী পরীক্ষা দিতে পারবে, যদি তার বয়স 30-এর কম হয় এবং কাজের অভিজ্ঞতা 2 বছরের বেশি হয়। আর না হয় চাকরির পরীক্ষা দিতে পারবে না। এমন একটা প্রোগ্রাম লিখ।
*5. তোর ফ্রিজের ভেতর ডিমের সংখ্যা 12-এর বেশি অথবা মুরগি না থাকে, তাহলে তুই ডিমের কোরমা রান্না করবি। আর না হলে পাউরুটি আর কলা খাবি। এমন একটা কোড লিখ ।
*6. একজন মানুষের যদি শরীরের তাপমাত্রা 100 ডিগ্রির বেশি অথবা কাশি থাকে, তাহলে সে ডাক্তারের কাছে যাবে। নচেৎ সে কাঁথা মুড়ি দিয়ে শুয়ে থাকবে। এর জন্য একটা প্রোগ্রাম লিখ।
*7. একজন শিক্ষার্থীকে পরীক্ষা দিতে দেয়া হবে, যদি তার উপস্থিতি ৪০ শতাংশের বেশি এবং হোমওয়ার্ক জমা দেয়া থাকে। নচেৎ অটো ফেল। এই শর্তের জন্য প্রোগ্রাম লিখ।
*৪. যদি তোর বাসার বিদ্যুৎ চলে যায় এবং মোবাইলে চার্জ না থাকে, তাহলে তুই পড়তে বসবি। না হলে ভিডিও গেম খেলবি। এর জন্য কোড লিখ।
*9. শার্টের দাম 1000 টাকার বেশি হলে এবং কুপন থাকলে তোকে 20 পারসেন্ট ডিসকাউন্ট দেয়া হবে। এর জন্য প্রোগ্রাম লিখ।

*/
//1.
let age = 19;
let height = 61;
if (age > 18 && height > 60) {
    console.log("গাড়ি ঠেলবে");
} else {
    console.log("গাড়িতে বসে থাকবে");
}

//2.
let mathScore = 81;
let englishScore = 80;
if (mathScore > 80 || englishScore > 85) {
    console.log("ভর্তি হওয়ার যোগ্য");
} else {
    console.log("তোকে বিয়ে দিয়ে দিব");
}

//3.
let gpa = 5;
let familyIncome = 10000;
if (gpa === 5 && familyIncome <= 10000) {
    console.log("স্কলার শিপ পাবে");
} else {
    console.log("বেতন দিয়ে পড়তে হবে");
}

//4.
let candidateAge = 30;
let experience = 2;
if (candidateAge <= 30 && experience >= 2) {
    console.log("চাকরির পরীক্ষা দিতে পারবে");
} else {
    console.log("চাকরির পরীক্ষা দিতে পারবে না");
}

//5.
let eggCount = 11;
let hasChicken = false;
if (eggCount > 12 || !hasChicken) {
    console.log("ডিমের কোরমা রান্না করবি");
} else {
    console.log("পাউরুটি আর কলা খাবি");
}

//6.
let bodyTemperature = 100;
let hasCough = false;
if (bodyTemperature > 100 || hasCough) {
    console.log("ডাক্তারের কাছে যাবে");
} else {
    console.log("কাঁথা মুড়ি দিয়ে শুয়ে থাকবে");
}

//7.
let attendancePercentage = 41;
let homeworkSubmitted = true;
if (attendancePercentage >= 40 && homeworkSubmitted) {
    console.log("পরীক্ষা দিতে পাড়বে");
} else {
    console.log("পরীক্ষা পাড়বে না");
}

//8.
let powerOutage = true;
let phoneCharged = true;
if (powerOutage && phoneCharged) {
    console.log("পড়তে হবে");
} else {
    console.log("ভিডিও গেম খেলবি");
}

//9.
let shirtPrice = 1000;
let hasCoupon = true;
if (shirtPrice > 1000 && hasCoupon) {
    console.log("20 পারসেন্ট ডিসকাউন্ট দেয়া হবে");
} else {
    console.log("ডিসকাউন্ট নেই");
}